 # 올바른 변수 이름
my_variable = 10     # 変数名は英数字とアンダースコア（_）のみを含むことができます。特殊文字（例: $）やスペースは含めることができません。
variable2 = "Hello"  # 変数名は数字で始めることはできません。数字は変数名の途中や末尾には使うことができますが、始めることはできません。
number3 = 3.14


#Error 발생, 이유
# 1st_number = 1  # 変数名は数字で始めることはできません。数字は変数名の途中や末尾には使うことができますが、始めることはできません。
# my-variable 10  # my-variableはハイフン（-）を含むため、正しい変数名ではありません。
# $variable       # $variableはドル記号（$）を含むため、正しい変数名ではありません。

# Pythonの予約語（キーワード）は変数名として使用できません。たとえば、"for"や"if"などの予約語は変数名として使うことができません。
# for = "loop"    # forとifはPythonの予約語であるため、変数名として使うことができません。
# if = true       # forとifはPythonの予約語であるため、変数名として使うことができません。
 
 
 
# これらの問題を解決するには、適切な変数名を使う必要があります。例えば、次のように書くことができます 
first_number = 1
my_variable_10 = 10
variable = "something"
loop = "for loop"
is_true = True
